---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet
source: html/7d71ff6e-c021-9a60-6797-745c60188d7e.htm
---
# TemperatureRatingTypeSet Methods

Removes every TemperatureRating type from the set, rendering it empty.